SFI.html
<?xml version="1.0" encoding="utf-8"?>
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-10-02 Fri 02:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>SFI</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="ST-Saint" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">SFI</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org5d524cd">1. Prerequisites</a>
<ul>
<li><a href="#org86a0300">1.1. linux cross platform</a></li>
<li><a href="#orgcb87750">1.2. Bionic-Builder</a></li>
</ul>
</li>
<li><a href="#org2f76d2e">2. commands</a>
<ul>
<li><a href="#org35ae219">2.1. linux cross compile</a></li>
<li><a href="#org1f73071">2.2. network</a></li>
</ul>
</li>
<li><a href="#orga5ded3d">3. <span class="done DONE">DONE</span> USB Serial Debug</a>
<ul>
<li><a href="#org617d6b9">3.1. <code>[1/1]</code> issue</a>
<ul>
<li><a href="#orgf61a13f">3.1.1. <span class="done DONE">DONE</span> ttyACM 无法输入</a></li>
</ul>
</li>
<li><a href="#org098964a">3.2. 串口调试</a></li>
</ul>
</li>
<li><a href="#org801ada3">4. <span class="done DONE">DONE</span> register hw\<sub>breakpoint</sub> linux work flow</a></li>
<li><a href="#orgd29898f">5. DBG registers</a>
<ul>
<li><a href="#org8d35525">5.1. DBGBCR&lt;n&gt;<sub>EL1</sub></a></li>
<li><a href="#org2af1f42">5.2. DBGBVR&lt;n&gt;<sub>EL1</sub></a></li>
<li><a href="#org7233dd4">5.3. DBGWCR&lt;n&gt;<sub>EL1</sub></a></li>
</ul>
</li>
<li><a href="#org6f21911">6. UNDO</a>
<ul>
<li><a href="#org11361cd">6.1. system call</a></li>
<li><a href="#org50450b7">6.2. <span class="todo ___">[ ]</span> 修改 BCR, BVR 寄存器</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org5d524cd" class="outline-2">
<h2 id="org5d524cd"><span class="section-number-2">1</span> Prerequisites</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org86a0300" class="outline-3">
<h3 id="org86a0300"><span class="section-number-3">1.1</span> linux cross platform</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #ECBE7B;">sudo</span> apt-get install gcc-aarch64-linux-gnu
</pre>
</div>
</div>
</div>
<div id="outline-container-orgcb87750" class="outline-3">
<h3 id="orgcb87750"><span class="section-number-3">1.2</span> Bionic-Builder</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #ECBE7B;">sudo</span> apt-get install -y ccache python-pip build-essential kernel-package fakeroot libncurses5-dev libssl-dev gcc  git-core gnupg binfmt-support qemu qemu-user-static debootstrap simg2img
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org2f76d2e" class="outline-2">
<h2 id="org2f76d2e"><span class="section-number-2">2</span> commands</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org35ae219" class="outline-3">
<h3 id="org35ae219"><span class="section-number-3">2.1</span> linux cross compile</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #ECBE7B;">sudo</span> <span style="color: #ECBE7B;">make</span> -j20 <span style="color: #dcaeea;">ARCH</span>=arm64 <span style="color: #dcaeea;">CROSS_COMPILE</span>=aarch64-linux-gnu- hikey970_defconfig
<span style="color: #ECBE7B;">sudo</span> <span style="color: #ECBE7B;">make</span> -j20 <span style="color: #dcaeea;">ARCH</span>=arm64 <span style="color: #dcaeea;">CROSS_COMPILE</span>=aarch64-linux-gnu- all
</pre>
</div>
</div>
</div>
<div id="outline-container-org1f73071" class="outline-3">
<h3 id="org1f73071"><span class="section-number-3">2.2</span> network</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li><p>
connect wifi from terminal
</p>

<div class="org-src-container">
<pre class="src src-bash">  <span style="color: #ECBE7B;">sudo</span> nmcli dev wifi connect <span style="color: #98be65;">'SSID'</span>
</pre>
</div></li>

<li><p>
control
</p>
<div class="org-src-container">
<pre class="src src-bash"> <span style="color: #ECBE7B;">sudo</span> nmcli
</pre>
</div></li>
</ul>
</div>
</div>
</div>


<div id="outline-container-orga5ded3d" class="outline-2">
<h2 id="orga5ded3d"><span class="section-number-2">3</span> <span class="done DONE">DONE</span> USB Serial Debug</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org617d6b9" class="outline-3">
<h3 id="org617d6b9"><span class="section-number-3">3.1</span> <code>[1/1]</code> issue</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-orgf61a13f" class="outline-4">
<h4 id="orgf61a13f"><span class="section-number-4">3.1.1</span> <span class="done DONE">DONE</span> ttyACM 无法输入</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
<a href="https://discuss.96boards.org/t/how-to-connect-to-console-in-hikey970-in-android/5484/10">XR21V1410 USB-UART</a>
</p>

<blockquote>
<p>
Hikey970 uses XR21B14 chip for the USB-C debug serial port. The driver for this chip is not available in upstream linux kernel but since it supports part of USB CDC class, it does appear as ttyACM0 port. But this chip uses custom flow control modes which can’t be supported by usb cdc driver and flow control is needed for input. That’s why you can’t type anything onto the default ttyACM0 console but you can see the output.
</p>

<p>
Coming to your question on some people got it working fully, that is mainly due to the packaging of specific driver for this chip in the distro version. For instance, Ubuntu 18.04 has this driver enabled, so users who have this specific distro will be able to use it without any issues. They will have the console as ttyXRUSB0 instead of ttyACM0.
</p>

<p>
So if you need to use this port, please build the driver(just google xr21b14 driver, you’ll find it) and load onto your PC.
</p>
</blockquote>


<p>
<a href="https://www.maxlinear.com/support/design-tools/software-drivers">XR21V1410 Driver</a>
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #ECBE7B;">sudo</span> rmmod cdc_acm
<span style="color: #ECBE7B;">sudo</span> insmod xr_sub_serial_common.ko
</pre>
</div>

<p>
重新插拔 Type-C USB, hikey970 被识别为 <code>ttyXRUSB</code>
</p>
</div>
</div>
</div>

<div id="outline-container-org098964a" class="outline-3">
<h3 id="org098964a"><span class="section-number-3">3.2</span> 串口调试</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>minicom 115200 8N1</li>
<li><b>hardware / software flow control: No</b></li>
</ul>
</div>
</div>
</div>
