SFI.html


<div id="outline-container-org801ada3" class="outline-2">
<h2 id="org801ada3"><span class="section-number-2">4</span> <span class="done DONE">DONE</span> register hw\<sub>breakpoint</sub> linux work flow</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><code>linux-5.8/kernel/events/hw_breakpoint.c *register_wide_hw_breakpoint*</code></li>
</ul>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #83898d;">/**</span>
<span style="color: #83898d;"> * register_wide_hw_breakpoint - register a wide breakpoint in the kernel</span>
<span style="color: #83898d;"> * </span><span style="color: #a9a1e1;">@attr</span><span style="color: #83898d;">: breakpoint attributes</span>
<span style="color: #83898d;"> * </span><span style="color: #a9a1e1;">@triggered</span><span style="color: #83898d;">: callback to trigger when we hit the breakpoint</span>
<span style="color: #83898d;"> *</span>
<span style="color: #83898d;"> * </span><span style="color: #a9a1e1;">@return</span><span style="color: #83898d;"> a set of per_cpu pointers to perf events</span>
<span style="color: #83898d;"> */</span>

<span style="color: #51afef;">struct</span> <span style="color: #ECBE7B;">perf_event</span> * <span style="color: #c678dd;">__percpu</span> *
register_wide_hw_breakpoint<span style="color: #51afef;">(</span><span style="color: #51afef;">struct</span> <span style="color: #ECBE7B;">perf_event_attr</span> *<span style="color: #dcaeea;">attr</span>,
                <span style="color: #ECBE7B;">perf_overflow_handler_t</span> <span style="color: #dcaeea;">triggered</span>,
                <span style="color: #ECBE7B;">void</span> *<span style="color: #dcaeea;">context</span><span style="color: #51afef;">)</span>;

...<span style="color: #da8548; font-weight: bold;">571</span>
        bp = perf_event_create_kernel_counter<span style="color: #51afef;">(</span>attr, cpu, <span style="color: #a9a1e1;">NULL</span>,
                              triggered, context<span style="color: #51afef;">)</span>;
</pre>
</div>

<ul class="org-ul">
<li><p>
<code>linux-5.8/kernel/events/core.c *perf_event_create_kernel_counter*</code>
</p>

<div class="org-src-container">
<pre class="src src-c"> <span style="color: #83898d;">/**</span>
<span style="color: #83898d;"> * perf_event_create_kernel_counter</span>
<span style="color: #83898d;"> *</span>
<span style="color: #83898d;"> * </span><span style="color: #a9a1e1;">@attr</span><span style="color: #83898d;">: attributes of the counter to create</span>
<span style="color: #83898d;"> * </span><span style="color: #a9a1e1;">@cpu</span><span style="color: #83898d;">: cpu in which the counter is bound</span>
<span style="color: #83898d;"> * </span><span style="color: #a9a1e1;">@task</span><span style="color: #83898d;">: task to profile (NULL for percpu)</span>
<span style="color: #83898d;"> */</span>
<span style="color: #51afef;">struct</span> <span style="color: #ECBE7B;">perf_event</span> *
<span style="color: #c678dd;">perf_event_create_kernel_counter</span><span style="color: #51afef;">(</span><span style="color: #51afef;">struct</span> <span style="color: #ECBE7B;">perf_event_attr</span> *<span style="color: #dcaeea;">attr</span>, <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">cpu</span>,
                 <span style="color: #51afef;">struct</span> <span style="color: #ECBE7B;">task_struct</span> *<span style="color: #dcaeea;">task</span>,
                 <span style="color: #ECBE7B;">perf_overflow_handler_t</span> <span style="color: #dcaeea;">overflow_handler</span>,
                 <span style="color: #ECBE7B;">void</span> *<span style="color: #dcaeea;">context</span><span style="color: #51afef;">)</span>;
...<span style="color: #da8548; font-weight: bold;">11952</span>
    event = perf_event_alloc<span style="color: #51afef;">(</span>attr, cpu, task, <span style="color: #a9a1e1;">NULL</span>, <span style="color: #a9a1e1;">NULL</span>,
                 overflow_handler, context, -<span style="color: #da8548; font-weight: bold;">1</span><span style="color: #51afef;">)</span>;
</pre>
</div></li>

<li><p>
<code>linux-5.8/kernel/events/core.c *perf_event_alloc*</code>
</p>

<div class="org-src-container">
<pre class="src src-c"> <span style="color: #5B6268;">/*</span>
<span style="color: #5B6268;"> * Allocate and initialize an event structure</span>
<span style="color: #5B6268;"> </span><span style="color: #5B6268;">*/</span>
<span style="color: #51afef;">static</span> <span style="color: #51afef;">struct</span> <span style="color: #ECBE7B;">perf_event</span> *
<span style="color: #c678dd;">perf_event_alloc</span><span style="color: #51afef;">(</span><span style="color: #51afef;">struct</span> <span style="color: #ECBE7B;">perf_event_attr</span> *<span style="color: #dcaeea;">attr</span>, <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">cpu</span>,
                 <span style="color: #51afef;">struct</span> <span style="color: #ECBE7B;">task_struct</span> *<span style="color: #dcaeea;">task</span>,
                 <span style="color: #51afef;">struct</span> <span style="color: #ECBE7B;">perf_event</span> *<span style="color: #dcaeea;">group_leader</span>,
                 <span style="color: #51afef;">struct</span> <span style="color: #ECBE7B;">perf_event</span> *<span style="color: #dcaeea;">parent_event</span>,
                 <span style="color: #ECBE7B;">perf_overflow_handler_t</span> <span style="color: #dcaeea;">overflow_handler</span>,
                 <span style="color: #ECBE7B;">void</span> *<span style="color: #dcaeea;">context</span>, <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">cgroup_fd</span><span style="color: #51afef;">)</span>

...<span style="color: #da8548; font-weight: bold;">11035</span>
    event-&gt;cpu      = cpu;
    event-&gt;attr     = *attr;
    event-&gt;group_leader = group_leader;
    event-&gt;pmu      = <span style="color: #a9a1e1;">NULL</span>;
    event-&gt;oncpu        = -<span style="color: #da8548; font-weight: bold;">1</span>;

    event-&gt;parent       = parent_event;

    event-&gt;ns       = get_pid_ns<span style="color: #51afef;">(</span>task_active_pid_ns<span style="color: #c678dd;">(</span>current<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>;
    event-&gt;id       = atomic64_inc_return<span style="color: #51afef;">(</span>&amp;perf_event_id<span style="color: #51afef;">)</span>;

...<span style="color: #da8548; font-weight: bold;">11110</span>
    pmu = perf_init_event<span style="color: #51afef;">(</span>event<span style="color: #51afef;">)</span>;
</pre>
</div></li>
<li><code>*perf_init_event*</code></li>
</ul>


<div class="org-src-container">
<pre class="src src-c">
<span style="color: #51afef;">static</span> <span style="color: #51afef;">struct</span> <span style="color: #ECBE7B;">pmu</span> *<span style="color: #c678dd;">perf_init_event</span><span style="color: #51afef;">(</span><span style="color: #51afef;">struct</span> <span style="color: #ECBE7B;">perf_event</span> *<span style="color: #dcaeea;">event</span><span style="color: #51afef;">)</span>
        ret = perf_try_init_event<span style="color: #51afef;">(</span>pmu, event<span style="color: #51afef;">)</span>;
</pre>
</div>

<p>
call <code>*pmu.event_init(event)*</code>
</p>

<p>
&#x2026;
</p>

<ul class="org-ul">
<li><code>linux-5.8/kernel/events/hw_breakpoint.c</code></li>
</ul>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #51afef;">static</span> <span style="color: #51afef;">struct</span> <span style="color: #ECBE7B;">pmu</span> <span style="color: #dcaeea;">perf_breakpoint</span> = <span style="color: #51afef;">{</span>
    .task_ctx_nr    = perf_sw_context, <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">could eventually get its own </span><span style="color: #5B6268;">*/</span>

    .event_init = hw_breakpoint_event_init,
    .add            = hw_breakpoint_add,
    .del            = hw_breakpoint_del,
    .start      = hw_breakpoint_start,
    .stop       = hw_breakpoint_stop,
    .read       = hw_breakpoint_pmu_read,
<span style="color: #51afef;">}</span>;

</pre>
</div>

<ul class="org-ul">
<li><code>*hw_breakpoint_event_init*</code></li>
</ul>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #51afef;">static</span> <span style="color: #ECBE7B;">int</span> <span style="color: #c678dd;">hw_breakpoint_event_init</span><span style="color: #51afef;">(</span><span style="color: #51afef;">struct</span> <span style="color: #ECBE7B;">perf_event</span> *<span style="color: #dcaeea;">bp</span><span style="color: #51afef;">)</span>
<span style="color: #51afef;">{</span>
    <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">err</span>;

    <span style="color: #51afef;">if</span> <span style="color: #c678dd;">(</span>bp-&gt;attr.type != <span style="color: #a9a1e1;">PERF_TYPE_BREAKPOINT</span><span style="color: #c678dd;">)</span>
        <span style="color: #51afef;">return</span> -<span style="color: #a9a1e1;">ENOENT</span>;

    <span style="color: #5B6268;">/*</span>
<span style="color: #5B6268;">     * no branch sampling for breakpoint events</span>
<span style="color: #5B6268;">     </span><span style="color: #5B6268;">*/</span>
    <span style="color: #51afef;">if</span> <span style="color: #c678dd;">(</span>has_branch_stack<span style="color: #98be65;">(</span>bp<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
        <span style="color: #51afef;">return</span> -<span style="color: #a9a1e1;">EOPNOTSUPP</span>;

    err = register_perf_hw_breakpoint<span style="color: #c678dd;">(</span>bp<span style="color: #c678dd;">)</span>;
    <span style="color: #51afef;">if</span> <span style="color: #c678dd;">(</span>err<span style="color: #c678dd;">)</span>
        <span style="color: #51afef;">return</span> err;

    bp-&gt;destroy = bp_perf_event_destroy;

    <span style="color: #51afef;">return</span> <span style="color: #da8548; font-weight: bold;">0</span>;
<span style="color: #51afef;">}</span>
</pre>
</div>

<ul class="org-ul">
<li><code>*register_perf_hw_breakpoint*</code></li>
</ul>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #ECBE7B;">int</span> <span style="color: #c678dd;">register_perf_hw_breakpoint</span><span style="color: #51afef;">(</span><span style="color: #51afef;">struct</span> <span style="color: #ECBE7B;">perf_event</span> *<span style="color: #dcaeea;">bp</span><span style="color: #51afef;">)</span>
<span style="color: #51afef;">{</span>
    <span style="color: #51afef;">struct</span> <span style="color: #ECBE7B;">arch_hw_breakpoint</span> <span style="color: #dcaeea;">hw</span> = <span style="color: #c678dd;">{</span> <span style="color: #c678dd;">}</span>;
    <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">err</span>;

    err = reserve_bp_slot<span style="color: #c678dd;">(</span>bp<span style="color: #c678dd;">)</span>;
    <span style="color: #51afef;">if</span> <span style="color: #c678dd;">(</span>err<span style="color: #c678dd;">)</span>
        <span style="color: #51afef;">return</span> err;

    err = hw_breakpoint_parse<span style="color: #c678dd;">(</span>bp, &amp;bp-&gt;attr, &amp;hw<span style="color: #c678dd;">)</span>;
    <span style="color: #51afef;">if</span> <span style="color: #c678dd;">(</span>err<span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span>
        release_bp_slot<span style="color: #98be65;">(</span>bp<span style="color: #98be65;">)</span>;
        <span style="color: #51afef;">return</span> err;
    <span style="color: #c678dd;">}</span>

    bp-&gt;hw.info = hw;

    <span style="color: #51afef;">return</span> <span style="color: #da8548; font-weight: bold;">0</span>;
<span style="color: #51afef;">}</span>
</pre>
</div>

<p>
reserve / release 加锁
</p>

<ul class="org-ul">
<li><code>*hw_breakpoint_parse*</code></li>
</ul>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #51afef;">static</span> <span style="color: #ECBE7B;">int</span> <span style="color: #c678dd;">hw_breakpoint_parse</span><span style="color: #51afef;">(</span><span style="color: #51afef;">struct</span> <span style="color: #ECBE7B;">perf_event</span> *<span style="color: #dcaeea;">bp</span>,
                   <span style="color: #51afef;">const</span> <span style="color: #51afef;">struct</span> <span style="color: #ECBE7B;">perf_event_attr</span> *<span style="color: #dcaeea;">attr</span>,
                   <span style="color: #51afef;">struct</span> <span style="color: #ECBE7B;">arch_hw_breakpoint</span> *<span style="color: #dcaeea;">hw</span><span style="color: #51afef;">)</span>
<span style="color: #51afef;">{</span>
    <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">err</span>;

    err = hw_breakpoint_arch_parse<span style="color: #c678dd;">(</span>bp, attr, hw<span style="color: #c678dd;">)</span>;
    <span style="color: #51afef;">if</span> <span style="color: #c678dd;">(</span>err<span style="color: #c678dd;">)</span>
        <span style="color: #51afef;">return</span> err;

    <span style="color: #51afef;">if</span> <span style="color: #c678dd;">(</span>arch_check_bp_in_kernelspace<span style="color: #98be65;">(</span>hw<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span>
        <span style="color: #51afef;">if</span> <span style="color: #98be65;">(</span>attr-&gt;exclude_kernel<span style="color: #98be65;">)</span>
            <span style="color: #51afef;">return</span> -<span style="color: #a9a1e1;">EINVAL</span>;
        <span style="color: #5B6268;">/*</span>
<span style="color: #5B6268;">         * Don't let unprivileged users set a breakpoint in the trap</span>
<span style="color: #5B6268;">         * path to avoid trap recursion attacks.</span>
<span style="color: #5B6268;">         </span><span style="color: #5B6268;">*/</span>
        <span style="color: #51afef;">if</span> <span style="color: #98be65;">(</span><span style="color: #51afef; font-weight: bold;">!</span>capable<span style="color: #51afef;">(</span><span style="color: #a9a1e1;">CAP_SYS_ADMIN</span><span style="color: #51afef;">)</span><span style="color: #98be65;">)</span>
            <span style="color: #51afef;">return</span> -<span style="color: #a9a1e1;">EPERM</span>;
    <span style="color: #c678dd;">}</span>

    <span style="color: #51afef;">return</span> <span style="color: #da8548; font-weight: bold;">0</span>;
<span style="color: #51afef;">}</span>
</pre>
</div>

<ul class="org-ul">
<li><p>
<code>*hw_breakpoint_arch_parse*</code>
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #5B6268;">/*</span>
<span style="color: #5B6268;"> * Validate the arch-specific HW Breakpoint register settings.</span>
<span style="color: #5B6268;"> </span><span style="color: #5B6268;">*/</span>
<span style="color: #ECBE7B;">int</span> <span style="color: #c678dd;">hw_breakpoint_arch_parse</span><span style="color: #51afef;">(</span><span style="color: #51afef;">struct</span> <span style="color: #ECBE7B;">perf_event</span> *<span style="color: #dcaeea;">bp</span>,
                 <span style="color: #51afef;">const</span> <span style="color: #51afef;">struct</span> <span style="color: #ECBE7B;">perf_event_attr</span> *<span style="color: #dcaeea;">attr</span>,
                 <span style="color: #51afef;">struct</span> <span style="color: #ECBE7B;">arch_hw_breakpoint</span> *<span style="color: #dcaeea;">hw</span><span style="color: #51afef;">)</span>
<span style="color: #51afef;">{</span>
    <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">ret</span>;
    <span style="color: #ECBE7B;">u64</span> <span style="color: #dcaeea;">alignment_mask</span>, <span style="color: #dcaeea;">offset</span>;

    <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">Build the arch_hw_breakpoint. </span><span style="color: #5B6268;">*/</span>
    ret = arch_build_bp_info<span style="color: #c678dd;">(</span>bp, attr, hw<span style="color: #c678dd;">)</span>;
...
<span style="color: #51afef;">}</span>
</pre>
</div>

<ul class="org-ul">
<li><code>*hw_breakpoint_add*</code></li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #51afef;">static</span> <span style="color: #ECBE7B;">int</span> <span style="color: #c678dd;">hw_breakpoint_add</span><span style="color: #51afef;">(</span><span style="color: #51afef;">struct</span> <span style="color: #ECBE7B;">perf_event</span> *<span style="color: #dcaeea;">bp</span>, <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">flags</span><span style="color: #51afef;">)</span>
<span style="color: #51afef;">{</span>
    <span style="color: #51afef;">if</span> <span style="color: #c678dd;">(</span><span style="color: #51afef; font-weight: bold;">!</span><span style="color: #98be65;">(</span>flags &amp; <span style="color: #a9a1e1;">PERF_EF_START</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
        bp-&gt;hw.state = <span style="color: #a9a1e1;">PERF_HES_STOPPED</span>;

    <span style="color: #51afef;">if</span> <span style="color: #c678dd;">(</span>is_sampling_event<span style="color: #98be65;">(</span>bp<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span>
        bp-&gt;hw.last_period = bp-&gt;hw.sample_period;
        perf_swevent_set_period<span style="color: #98be65;">(</span>bp<span style="color: #98be65;">)</span>;
    <span style="color: #c678dd;">}</span>

    <span style="color: #51afef;">return</span> arch_install_hw_breakpoint<span style="color: #c678dd;">(</span>bp<span style="color: #c678dd;">)</span>;
<span style="color: #51afef;">}</span>
</pre>
</div>

<ul class="org-ul">
<li><p>
<code>linux-5.8/arch/arm64/kernel/hw_breakpoint.c *arch_install_hw_breakpoint*</code>
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #5B6268;">/*</span>
<span style="color: #5B6268;"> * Install a perf counter breakpoint.</span>
<span style="color: #5B6268;"> </span><span style="color: #5B6268;">*/</span>
<span style="color: #ECBE7B;">int</span> <span style="color: #c678dd;">arch_install_hw_breakpoint</span><span style="color: #51afef;">(</span><span style="color: #51afef;">struct</span> <span style="color: #ECBE7B;">perf_event</span> *<span style="color: #dcaeea;">bp</span><span style="color: #51afef;">)</span>
<span style="color: #51afef;">{</span>
    <span style="color: #51afef;">return</span> hw_breakpoint_control<span style="color: #c678dd;">(</span>bp, <span style="color: #a9a1e1;">HW_BREAKPOINT_INSTALL</span><span style="color: #c678dd;">)</span>;
<span style="color: #51afef;">}</span>

</pre>
</div></li>

<li><code>linux-5.8/arch/arm64/kernel/hw_breakpoint.c *hw_breakpoint_control*</code></li>
</ul>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #51afef;">static</span> <span style="color: #ECBE7B;">int</span> <span style="color: #c678dd;">hw_breakpoint_control</span><span style="color: #51afef;">(</span><span style="color: #51afef;">struct</span> <span style="color: #ECBE7B;">perf_event</span> *<span style="color: #dcaeea;">bp</span>,
                 <span style="color: #51afef;">enum</span> <span style="color: #ECBE7B;">hw_breakpoint_ops</span> <span style="color: #dcaeea;">ops</span><span style="color: #51afef;">)</span>
<span style="color: #51afef;">{</span>
    <span style="color: #51afef;">struct</span> <span style="color: #ECBE7B;">arch_hw_breakpoint</span> *<span style="color: #dcaeea;">info</span> = counter_arch_bp<span style="color: #c678dd;">(</span>bp<span style="color: #c678dd;">)</span>;
    <span style="color: #51afef;">struct</span> <span style="color: #ECBE7B;">perf_event</span> **<span style="color: #dcaeea;">slots</span>;
    <span style="color: #51afef;">struct</span> <span style="color: #ECBE7B;">debug_info</span> *<span style="color: #dcaeea;">debug_info</span> = &amp;current-&gt;thread.debug;
    <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">i</span>, <span style="color: #dcaeea;">max_slots</span>, <span style="color: #dcaeea;">ctrl_reg</span>, <span style="color: #dcaeea;">val_reg</span>, <span style="color: #dcaeea;">reg_enable</span>;
    <span style="color: #51afef;">enum</span> <span style="color: #ECBE7B;">dbg_active_el</span> <span style="color: #dcaeea;">dbg_el</span> = debug_exception_level<span style="color: #c678dd;">(</span>info-&gt;ctrl.privilege<span style="color: #c678dd;">)</span>;
    <span style="color: #ECBE7B;">u32</span> <span style="color: #dcaeea;">ctrl</span>;

    <span style="color: #51afef;">if</span> <span style="color: #c678dd;">(</span>info-&gt;ctrl.type == <span style="color: #a9a1e1;">ARM_BREAKPOINT_EXECUTE</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span>
        <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">Breakpoint </span><span style="color: #5B6268;">*/</span>
        ctrl_reg = AARCH64_DBG_REG_BCR;
        val_reg = AARCH64_DBG_REG_BVR;
        slots = this_cpu_ptr<span style="color: #98be65;">(</span>bp_on_reg<span style="color: #98be65;">)</span>;
        max_slots = core_num_brps;
        reg_enable = <span style="color: #51afef; font-weight: bold;">!</span>debug_info-&gt;bps_disabled;
    <span style="color: #c678dd;">}</span> <span style="color: #51afef;">else</span> <span style="color: #c678dd;">{</span>
        <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">Watchpoint </span><span style="color: #5B6268;">*/</span>
        ctrl_reg = AARCH64_DBG_REG_WCR;
        val_reg = AARCH64_DBG_REG_WVR;
        slots = this_cpu_ptr<span style="color: #98be65;">(</span>wp_on_reg<span style="color: #98be65;">)</span>;
        max_slots = core_num_wrps;
        reg_enable = <span style="color: #51afef; font-weight: bold;">!</span>debug_info-&gt;wps_disabled;
    <span style="color: #c678dd;">}</span>

    i = hw_breakpoint_slot_setup<span style="color: #c678dd;">(</span>slots, max_slots, bp, ops<span style="color: #c678dd;">)</span>;

    <span style="color: #51afef;">if</span> <span style="color: #c678dd;">(</span><span style="color: #a9a1e1;">WARN_ONCE</span><span style="color: #98be65;">(</span>i &lt; <span style="color: #da8548; font-weight: bold;">0</span>, <span style="color: #98be65;">"Can't find any breakpoint slot"</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
        <span style="color: #51afef;">return</span> i;

    <span style="color: #51afef;">switch</span> <span style="color: #c678dd;">(</span>ops<span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span>
    <span style="color: #51afef;">case</span> <span style="color: #a9a1e1;">HW_BREAKPOINT_INSTALL</span>:
        <span style="color: #5B6268;">/*</span>
<span style="color: #5B6268;">         * Ensure debug monitors are enabled at the correct exception</span>
<span style="color: #5B6268;">         * level.</span>
<span style="color: #5B6268;">         </span><span style="color: #5B6268;">*/</span>
        enable_debug_monitors<span style="color: #98be65;">(</span>dbg_el<span style="color: #98be65;">)</span>;
        fallthrough;
    <span style="color: #51afef;">case</span> <span style="color: #a9a1e1;">HW_BREAKPOINT_RESTORE</span>:
        <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">Setup the address register. </span><span style="color: #5B6268;">*/</span>
        write_wb_reg<span style="color: #98be65;">(</span>val_reg, i, info-&gt;address<span style="color: #98be65;">)</span>;

        <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">Setup the control register. </span><span style="color: #5B6268;">*/</span>
        ctrl = encode_ctrl_reg<span style="color: #98be65;">(</span>info-&gt;ctrl<span style="color: #98be65;">)</span>;
        write_wb_reg<span style="color: #98be65;">(</span>ctrl_reg, i,
                 reg_enable ? ctrl | <span style="color: #da8548; font-weight: bold;">0x1</span> : ctrl &amp; ~<span style="color: #da8548; font-weight: bold;">0x1</span><span style="color: #98be65;">)</span>;
        <span style="color: #51afef;">break</span>;
    <span style="color: #51afef;">case</span> <span style="color: #a9a1e1;">HW_BREAKPOINT_UNINSTALL</span>:
        <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">Reset the control register. </span><span style="color: #5B6268;">*/</span>
        write_wb_reg<span style="color: #98be65;">(</span>ctrl_reg, i, <span style="color: #da8548; font-weight: bold;">0</span><span style="color: #98be65;">)</span>;

        <span style="color: #5B6268;">/*</span>
<span style="color: #5B6268;">         * Release the debug monitors for the correct exception</span>
<span style="color: #5B6268;">         * level.</span>
<span style="color: #5B6268;">         </span><span style="color: #5B6268;">*/</span>
        disable_debug_monitors<span style="color: #98be65;">(</span>dbg_el<span style="color: #98be65;">)</span>;
        <span style="color: #51afef;">break</span>;
    <span style="color: #c678dd;">}</span>

    <span style="color: #51afef;">return</span> <span style="color: #da8548; font-weight: bold;">0</span>;
<span style="color: #51afef;">}</span>
</pre>
</div>
</div>
</div>
